[
    {
        "id": "talkhub",
        "title": "LNMIIT TalkHub System",
        "description": "A mentorship platform connecting students with professionals to enhance engagement and learning.",
        "tech": [
            "React",
            "Node.js",
            "Express",
            "MongoDB"
        ],
        "year": "2025",
        "github": "https://github.com/ayush121314/TalkHub",
        "demo": "https://talkhub-three.vercel.app/",
        "highlights": [
            "Developed lecture-centric discussion application where each talk maps to an isolated forum, supporting posts, replies, and nested comment threads.",
            "Introduced email-based OTP authentication with expiry enforcement, ensuring secure and time-bound user registration.",
            "Engineered backend APIs for discussion threads, resource uploads, and lecture recording sharing, centralizing all lecture-related information in one platform."
        ]
    },
    {
        "id": "outpass",
        "title": "LNMIIT OutPass System",
        "description": "Digital campus exit platform reducing administrative processing time by 90%.",
        "tech": [
            "React",
            "Express",
            "MongoDB",
            "Node.js"
        ],
        "year": "2024",
        "github": "https://github.com/ayush121314/Outpass",
        "demo": "https://outpass-zeta.vercel.app/",
        "highlights": [
            "Delivered digital outpass management system to replace paper-based approvals, enabling students and visitors to submit requests, track status, and access historical records from a single platform.",
            "Secured platform with JWT authentication and email OTP verification for registration and login flows, reducing manual identity verification steps and minimizing unauthorized access cases.",
            "Created backend APIs for request submission, admin approval actions, and automated PDF generation, reducing average approval turnaround time by 90% and eliminating manual paperwork handling."
        ]
    }
]